[
  {
    "id": 1,
    "make": "Toyota",
    "model": "Camry",
    "year": 2020,
    "engineCapacity": "2.5L",
    "condition": "Used",
    "description": "This 2020 Toyota Camry is a well-maintained sedan with a 2.5L engine. It has a clean history with no reported accidents. The car is in excellent condition, with low mileage and a spotless interior. It's a buy-and-drive vehicle with no immediate need for repairs. Whether you're commuting or taking a road trip, this Camry offers a comfortable and reliable ride.",
    "price": 18000,
    "imageUrl": "/assets/images/toyota-camry.jpg",
    "type": "Sedan"
  },
  {
    "id": 2,
    "make": "Honda",
    "model": "CR-V",
    "year": 2019,
    "engineCapacity": "1.5L",
    "condition": "New",
    "description": "Introducing the 2019 Honda CR-V, a brand-new SUV that's never been used before. It's a spacious and family-friendly vehicle, perfect for trips and adventures. This CR-V has no history of accidents and is in pristine condition. With a powerful 1.5L engine, it's ready to hit the road. Enjoy modern features and reliability in this SUV.",
    "price": 22000,
    "imageUrl": "/assets/images/2019_Honda_CR-V.jpg",
    "type": "SUV"
  },
  {
    "id": 3,
    "make": "Ford",
    "model": "Focus",
    "year": 2021,
    "engineCapacity": "2.0L",
    "condition": "Used",
    "description": "The 2021 Ford Focus is a reliable and fuel-efficient hatchback. This used vehicle has been well-maintained and has a great history. It's perfect for city driving and offers excellent mileage. The car has no reported accidents and is in excellent condition. If you're looking for a compact and budget-friendly car, this Focus is an excellent choice.",
    "price": 15000,
    "imageUrl": "/assets/images/2021-Ford-Focus.jpg",
    "type": "Hatchback"
  },
  {
    "id": 4,
    "make": "Chevrolet",
    "model": "Malibu",
    "year": 2018,
    "engineCapacity": "2.0L",
    "condition": "Used",
    "description": "The 2018 Chevrolet Malibu is a classic American sedan that has been well-maintained throughout its life. It comes with a clean history and has never been involved in accidents. This car is in excellent condition and ready for a new owner. It offers a comfortable and spacious interior, making it ideal for daily commuting or family trips.",
    "price": 16000,
    "imageUrl": "/assets/images/chevrolet-malibu.jpg",
    "type": "Sedan"
  },
  {
    "id": 5,
    "make": "Nissan",
    "model": "Rogue",
    "year": 2017,
    "engineCapacity": "2.5L",
    "condition": "Used",
    "description": "The 2017 Nissan Rogue is an all-wheel drive SUV that's perfect for all-weather driving. It has a clean history and has been well-maintained. The car is in great condition and offers ample space for passengers and cargo. It's a reliable and comfortable choice for those who love road trips and adventures.",
    "price": 17000,
    "imageUrl": "/assets/images/2017_Nissan_rogue.jpg",
    "type": "SUV"
  },
  {
    "id": 6,
    "make": "Volkswagen",
    "model": "Golf",
    "year": 2019,
    "engineCapacity": "1.4L",
    "condition": "Used",
    "description": "The 2019 Volkswagen Golf is a fun-to-drive compact car that has been well-cared for. It has no history of accidents and is in great condition. This Golf is perfect for city driving and offers impressive fuel efficiency. Whether you're a daily commuter or simply looking for an economical ride, the Golf is an excellent choice.",
    "price": 14000,
    "imageUrl": "/assets/images/2019-volkswagen-golf-gti.jpg",
    "type": "Hatchback"
  },
  {
    "id": 7,
    "make": "Toyota",
    "model": "Corolla",
    "year": 2021,
    "engineCapacity": "1.8L",
    "condition": "New",
    "description": "The 2021 Toyota Corolla is a brand-new compact sedan that's never been driven. It offers reliability and fuel efficiency, making it an excellent choice for daily commuting. This Corolla has a clean history with no reported accidents. It's ready to hit the road with the latest features and a fresh interior.",
    "price": 20000,
    "imageUrl": "/assets/images/toyota-corolla-2021.jpg",
    "type": "Sedan"
  },
  {
    "id": 8,
    "make": "Jeep",
    "model": "Wrangler",
    "year": 2020,
    "engineCapacity": "3.6L",
    "condition": "Used",
    "description": "The 2020 Jeep Wrangler is an off-road ready SUV that's perfect for adventures. It has been well-maintained and is in excellent condition. This Wrangler has no history of accidents and is ready for your outdoor explorations. It offers a rugged and reliable driving experience, whether you're on the trails or the highway.",
    "price": 26000,
    "imageUrl": "/assets/images/2020-jeep-wrangler.jpg",
    "type": "SUV"
  },
  {
    "id": 9,
    "make": "Hyundai",
    "model": "Elantra",
    "year": 2019,
    "engineCapacity": "2.0L",
    "condition": "Used",
    "description": "The 2019 Hyundai Elantra is a comfortable and economical sedan that's perfect for daily driving. It has been well-cared for and is in excellent condition. This Elantra has no history of accidents and offers great fuel efficiency. If you're looking for a reliable and budget-friendly car, the Elantra is a great choice.",
    "price": 15000,
    "imageUrl": "/assets/images/hyundai-elantra-2019.jpg",
    "type": "Sedan"
  },
  {
    "id": 10,
    "make": "Subaru",
    "model": "Outback",
    "year": 2020,
    "engineCapacity": "2.5L",
    "condition": "Used",
    "description": "The 2020 Subaru Outback is an all-wheel drive SUV that's perfect for outdoor enthusiasts. It has been well-maintained and is in excellent condition. This Outback has a clean history and is ready for your next adventure. With ample cargo space and advanced features, it's ideal for camping trips and family outings.",
    "price": 22000,
    "imageUrl": "/assets/images/subaru_outback.jpg",
    "type": "SUV"
  },
  {
    "id": 11,
    "make": "Mazda",
    "model": "CX-5",
    "year": 2018,
    "engineCapacity": "2.5L",
    "condition": "Used",
    "description": "The 2018 Mazda CX-5 is a sporty and comfortable SUV that has been well-maintained. It offers a smooth and enjoyable ride, making it perfect for daily commuting or family trips. This CX-5 has no history of accidents and is in excellent condition. It combines style, performance, and practicality for an outstanding driving experience.",
    "price": 19000,
    "imageUrl": "/assets/images/2019-Mazda-CX-5.jpg",
    "type": "SUV"
  },
  {
    "id": 12,
    "make": "Ford",
    "model": "Mustang",
    "year": 2022,
    "engineCapacity": "5.0L",
    "condition": "New",
    "description": "The 2022 Ford Mustang is an iconic American muscle car that's brand-new and ready to roar. It offers thrilling performance and an aggressive design. This Mustang has no history of accidents and is in pristine condition. If you're looking for a classic and powerful ride, the Mustang is the perfect choice for enthusiasts.",
    "price": 35000,
    "imageUrl": "/assets/images/2022-Ford-Mustang.jpg",
    "type": "Sports Car"
  },
  {
    "id": 13,
    "make": "BMW",
    "model": "3 Series",
    "year": 2019,
    "engineCapacity": "2.0L",
    "condition": "Used",
    "description": "The 2019 BMW 3 Series is a luxurious and sporty sedan that offers a perfect balance of style and performance. It has been well-cared for and is in excellent condition. This 3 Series has no history of accidents and provides a smooth and refined driving experience. With advanced features and a premium interior, it's a top choice in the luxury sedan category.",
    "price": 28000,
    "imageUrl": "/assets/images/bmw-3-series-2019.jpeg",
    "type": "Sedan"
  },
  {
    "id": 14,
    "make": "Tesla",
    "model": "Model 3",
    "year": 2021,
    "engineCapacity": "Electric",
    "condition": "New",
    "description": "The 2021 Tesla Model 3 is a cutting-edge electric car that's brand-new and eco-friendly. It offers zero emissions and an impressive electric range. This Model 3 has no history of accidents and is in pristine condition. It's ready to redefine your driving experience with advanced technology and futuristic design.",
    "price": 42000,
    "imageUrl": "/assets/images/Tesla-Model-3.jpg",
    "type": "Electric"
  },
  {
    "id": 15,
    "make": "Audi",
    "model": "Q5",
    "year": 2020,
    "engineCapacity": "2.0L",
    "condition": "Used",
    "description": "The 2020 Audi Q5 is a premium SUV with advanced features and luxurious touches. It has been well-maintained and is in excellent condition. This Q5 has no history of accidents and offers a comfortable and refined driving experience. With a spacious interior and high-end materials, it's a top choice for those seeking a sophisticated SUV.",
    "price": 32000,
    "imageUrl": "/assets/images/2020_audi_q5.jpg",
    "type": "SUV"
  },
  {
    "id": 16,
    "make": "Kia",
    "model": "Soul",
    "year": 2021,
    "engineCapacity": "2.0L",
    "condition": "New",
    "description": "The 2021 Kia Soul is a compact and stylish hatchback that's brand-new and ready for your daily adventures. It offers a modern design and practicality. This Soul has no history of accidents and is in pristine condition. With advanced technology and a comfortable interior, it's a great choice for those who love city driving.",
    "price": 18000,
    "imageUrl": "/assets/images/kia-soul-2021.jpg",
    "type": "Hatchback"
  },
  {
    "id": 17,
    "make": "Volvo",
    "model": "XC90",
    "year": 2020,
    "engineCapacity": "2.0L",
    "condition": "Used",
    "description": "The 2020 Volvo XC90 is a luxury SUV with a focus on safety and high-quality materials. It has been well-cared for and is in excellent condition. This XC90 has no history of accidents and offers a refined and comfortable driving experience. With advanced safety features and a spacious interior, it's a top choice for families and long journeys.",
    "price": 35000,
    "imageUrl": "/assets/images/2020 Volvo XC90.jpg",
    "type": "SUV"
  },
  {
    "id": 18,
    "make": "Chrysler",
    "model": "300",
    "year": 2018,
    "engineCapacity": "3.6L",
    "condition": "Used",
    "description": "The 2018 Chrysler 300 is a classic American sedan with a spacious interior and powerful engine. It has been well-maintained and is in excellent condition. This 300 has no history of accidents and offers a comfortable and reliable driving experience. If you're looking for a timeless and comfortable sedan, the Chrysler 300 is an excellent choice.",
    "price": 20000,
    "imageUrl": "/assets/images/chrysler-300.jpg",
    "type": "Sedan"
  },
  {
    "id": 19,
    "make": "Hyundai",
    "model": "Tucson",
    "year": 2020,
    "engineCapacity": "2.4L",
    "condition": "Used",
    "description": "The 2020 Hyundai Tucson is a compact SUV with good fuel efficiency and practicality. It has been well-maintained and is in excellent condition. This Tucson has no history of accidents and is ready for your daily drives. With a comfortable interior and ample cargo space, it's an ideal choice for city and suburban living.",
    "price": 19000,
    "imageUrl": "/assets/images/Hyundai-Tucson-2020.jpg",
    "type": "SUV"
  },
  {
    "id": 20,
    "make": "Volkswagen",
    "model": "Jetta",
    "year": 2019,
    "engineCapacity": "1.4L",
    "condition": "Used",
    "description": "The 2019 Volkswagen Jetta is an efficient and comfortable sedan that's perfect for daily driving. It has been well-maintained and is in excellent condition. This Jetta has no history of accidents and offers great fuel efficiency. If you're looking for a reliable and budget-friendly car, the Jetta is a great choice.",
    "price": 16000,
    "imageUrl": "/assets/images/Volkswagen-Jetta-2019.jpg",
    "type": "Sedan"
  }
]
